content/software-engineering/debug/valgrind-practices.org
# -*- coding:utf-8 -*-
#+title: 调不尽的内存泄漏，用不完的 Valgrind
#+author: phenix3443
#+email: phenix3443+github@gmail.com
* Valgrind 安装
  #+BEGIN_SRC sh
      wget http://valgrind.org/downloads/valgrind-3.11.0.tar.bz2
      tar –jxvf ~/Downloads/valgrind-*.tar.bz2
      cd valgrind-3.11.0
      ./autogen.sh
      ./configure && make && sudo make install
  #+END_SRC
* Valgrind 包含的工具
  Valgrind 支持很多工具：memcheck，addrcheck，cachegrind，Massif，helgrind 和 Callgrind 等。在运行 Valgrind 时，你必须指明想用的工具,如果省略工具名，默认运行 memcheck。
** memcheck
   memcheck 探测程序中内存管理存在的问题。它检查所有对内存的读/写操作，并截取所有的 malloc/new/free/delete 调用。因此 memcheck 工具能够探测到以下问题：
   + 使用未初始化的内存
   + 读/写已经被释放的内存
   + 读/写内存越界
   + 读/写不恰当的内存栈空间
   + 内存泄漏
   + 使用 ~malloc/new/new[]~ 和 ~free/delete/delete[]~ 不匹配。
   + src 和 dst 的重叠
** cachegrind
   cachegrind 是一个 cache 剖析器。它模拟执行 CPU 中的 L1, D1 和 L2 cache，因此它能很精确的指出代码中的 cache 未命中。如果你需要，它可以打印出 cache 未命中的次数，内存引用和发生 cache 未命中的每一行代码，每一个函数，每一个模块和整个程序的摘要。如果你要求更细致的信息，它可以打印出每一行机器码的未命中次数。在 x86 和 amd64 上，cachegrind 通过 CPUID 自动探测机器的 cache 配置，所以在多数情况下它不再需要更多的配置信息了。
** helgrind
   它主要用来检查多线程程序中出现的竞争问题。Helgrind 寻找内存中被多个线程访问，而又没有一贯加锁的区域，这些区域往往是线程之间失去同步的地方，而且会导致难以发掘的错误。Helgrind 实现了名为”Eraser” 的竞争检测算法，并做了进一步改进，减少了报告错误的次数。
** Callgrind
   Callgrind 收集程序运行时的一些数据，函数调用关系等信息，还可以有选择地进行 cache 模拟。在运行结束时，它会把分析数据写入一个文件。 ~callgrind_annotate~ 可以把这个文件的内容转化成可读的形式。

   一般用法:

   #+BEGIN_SRC sh
       valgrind --tool=callgrind ./sec_infod
   #+END_SRC

   会在当前目录下生成 ~callgrind.out.[pid]~, 如果我们想结束程序, 可以

   #+BEGIN_SRC sh
       killall callgrind
   #+END_SRC

   然后我们可以用

   #+BEGIN_SRC sh
       callgrind_annotate --auto=yes callgrind.out.[pid] > log
       vi log
   #+END_SRC

** Massif
   堆栈分析器，它能测量程序在堆栈中使用了多少内存，告诉我们堆块，堆管理块和栈的大小。Massif 能帮助我们减少内存的使用，在带有虚拟内存的现代系统中，它还能够加速我们程序的运行，减少程序停留在交换区中的几率。
** lackey
   lackey 是一个示例程序，以其为模版可以创建你自己的工具。在程序结束后，它打印出一些基本的关于程序执行统计数据。
* Valgrind 的参数
  用法:
  #+BEGIN_EXAMPLE
      valgrind [options] prog-and-args [options]:
  #+END_EXAMPLE

** 常用选项
   适用于所有 Valgrind 工具。
   + ~--tool=<name>~
	 最常用的选项。运行 valgrind 中名为 toolname 的工具。默认 memcheck。
   + ~-h --help~

	 显示所有选项的帮助，包括内核和选定的工具两者。
   + ~--version~

	 显示 valgrind 内核的版本，每个工具都有各自的版本。
   + ~-q --quiet~

	 安静地运行，只打印错误信息。
   + ~--verbose~

	 更详细的信息。

   + ~--trace-children=<yes|no>~

	 跟踪子线程?  ~[default: no]~

   + ~--track-fds=<yes|no>~

	 跟踪打开的文件描述？ ~[default: no]~

   + ~--time-stamp=<yes|no>~

	 增加时间戳到 LOG 信息? ~[default: no]~

   + ~--log-fd=<number>~

	 输出 LOG 到描述符文件 [2=stderr]

   + ~--log-file=<file>~

	 将输出的信息写入到 filename.PID 的文件里，PID 是运行程序的进行 ID

   +  ~--log-file-exactly=<file>~

	 输出 LOG 信息到 file,LOG 信息输出

   +  ~--xml=yes~

	 将信息以 xml 格式输出，只有 memcheck 可用

   +  ~--num-callers=<number>~

	 show <number> callers in stack traces

   +  ~--error-exitcode=<number>~

	 如果发现错误则返回错误代码 [0=disable]

   +  ~--db-attach=<yes|no>~

	 当出现错误，valgrind 会自动启动调试器 gdb。[default: no]

   +  ~--db-command=<command>~

	 启动调试器的命令行选项[gdb -nw %f %p]
** 适用于 Memcheck 工具的相关选项：
   +  ~--leak-check=<no|summary|full>~

	 要求对 leak 给出详细信息? Leak 是指，存在一块没有被引用的内存空间，或没有被释放的内存空间，如 summary，只反馈一些总结信息，告诉你有多少个 malloc，多少个 free 等；如果是 full 将输出所有的 leaks，也就是定位到某一个 malloc/free。

   +  ~--show-reachable=<yes|no>~

	 如果为 no，只输出没有引用的内存 leaks，或指向 malloc 返回的内存块中部某处的 leaks [default: no]

   更详细的参数指令见附录 A。
* Valgrind 的使用
  首先，在编译程序的时候打开调试模式（gcc 编译器的-g 选项）。如果没有调试信息，即使最好的 valgrind 工具也将中能够猜测特定的代码是属于哪一个函数。打开调试选项进行编译后再用 valgrind 检查，valgrind 将会给你的个详细的报告，比如哪一行代码出现了内存泄漏。

  当检查的是 C++程序的时候，还应该考虑另一个选项 -fno-inline。它使得函数调用链很清晰，这样可以减少你在浏览大型 C++程序时的混乱。比如在使用这个选项的时候，用 memcheck 检查 openoffice 就很容易。当然，你可能不会做这项工作，但是使用这一选项使得 valgrind 生成更精确的错误报告和减少混乱。

  一些编译优化选项(比如-O2 或者更高的优化选项)，可能会使得 memcheck 提交错误的未初始化报告，因此，为了使得 valgrind 的报告更精确，在编译的时候最好不要使用优化选项。

  如果程序是通过脚本启动的，可以修改脚本里启动程序的代码，或者使用 ~--trace-children=yes~ 选项来运行脚本。
* Valgrind 的示例
** 使用未初始化的内存
   #+BEGIN_SRC c :tangle valgrind-practices/uninit-mem.c
	   #include <stdio.h>
	   int main(int argc, char *argv[])
	   {
		   int x;
		   if(x == 0) {
			   printf("X is zero");
		   }
		   return 0;
	   }
   #+END_SRC

   运行：
   #+BEGIN_SRC sh :export both
	  gcc -g uninit-mem.c -o uninit-mem
	  valgrind  --tool=memcheck ./uninit-mem
   #+END_SRC

   我们可以看到:
   + 左边显示类似行号的数字（10297）表示的是 Process ID。
   + 最上面的红色方框表示的是 valgrind 的版本信息。
   + 中间的红色方框表示 valgrind 通过运行被测试程序，发现的内存问题。通过阅读这些信息，可以发现：
	 - 这是一个对内存的非法写操作，非法写操作的内存是 4 bytes。
	 - 发生错误时的函数堆栈，以及具体的源代码行号。
	 - 非法写操作的具体地址空间。
   + 最下面的红色方框是对发现的内存问题和内存泄漏问题的总结。内存泄漏的大小（40 bytes）也能够被检测出来。

