software-engineering/debug/valgrind-practices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>调不尽的内存泄漏，用不完的 Valgrind</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="phenix3443" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">调不尽的内存泄漏，用不完的 Valgrind</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga62c103">1. Valgrind 安装</a></li>
<li><a href="#org6522b17">2. Valgrind 包含的工具</a>
<ul>
<li><a href="#org5823c6e">2.1. memcheck</a></li>
<li><a href="#org91fa15a">2.2. cachegrind</a></li>
<li><a href="#org1597144">2.3. helgrind</a></li>
<li><a href="#orge4fe75a">2.4. Callgrind</a></li>
<li><a href="#org2f9d6a0">2.5. Massif</a></li>
<li><a href="#org1eb30f5">2.6. lackey</a></li>
</ul>
</li>
<li><a href="#org4e615f1">3. Valgrind 的参数</a>
<ul>
<li><a href="#org087b1f4">3.1. 常用选项</a></li>
<li><a href="#orgdc44a44">3.2. 适用于 Memcheck 工具的相关选项：</a></li>
</ul>
</li>
<li><a href="#orgdd385f9">4. Valgrind 的使用</a></li>
<li><a href="#org648fbf8">5. Valgrind 的示例</a>
<ul>
<li><a href="#org50cde4a">5.1. 使用未初始化的内存</a>
<ul>
<li><a href="#orgbb50d61">5.1.1. 内存读写越界</a></li>
<li><a href="#org6caf18d">5.1.2. src 和 dst 内存覆盖</a></li>
<li><a href="#orgc0e9bad">5.1.3. 动态内存管理错误</a></li>
<li><a href="#orgdcf5477">5.1.4. 内存泄漏</a></li>
<li><a href="#orgc45e04b">5.1.5. 非法读写</a></li>
<li><a href="#orge3e58b6">5.1.6. 无效指针</a></li>
<li><a href="#org05bac9e">5.1.7. 重复释放</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc482202">6. Valgrind 的局限</a></li>
<li><a href="#org9b75b1d">7. 附录 A：参数指令</a>
<ul>
<li><a href="#org3bf84c4">7.1. 基本选项：</a></li>
<li><a href="#org415b5b0">7.2. 错误相关选项：</a></li>
<li><a href="#org3df8ef5">7.3. MALLOC() 相关的选项:</a></li>
<li><a href="#orge6aeced">7.4. 非通用选项：</a></li>
<li><a href="#orga2720a7">7.5. 调试 VALGRIND 选项：</a>
<ul>
<li><a href="#orga6dcfad">7.5.1. 内存检查选项：</a></li>
<li><a href="#org6ad326a">7.5.2. CACHEGRIND 选项：</a></li>
</ul>
</li>
<li><a href="#org7faf29b">7.6. CALLGRIND 选项：</a></li>
<li><a href="#org9979b89">7.7. HELGRIND 选项：</a></li>
<li><a href="#org8d8fef9">7.8. LACKEY 选项：</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga62c103" class="outline-2">
<h2 id="orga62c103"><span class="section-number-2">1</span> Valgrind 安装</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">      wget http://valgrind.org/downloads/valgrind-3.11.0.tar.bz2
      tar &#8211;jxvf ~/Downloads/valgrind-*.tar.bz2
      <span style="color: #d18aff;">cd</span> valgrind-3.11.0
      ./autogen.sh
      ./configure &amp;&amp; make &amp;&amp; sudo make install
</pre>
</div>
</div>
</div>
<div id="outline-container-org6522b17" class="outline-2">
<h2 id="org6522b17"><span class="section-number-2">2</span> Valgrind 包含的工具</h2>
<div class="outline-text-2" id="text-2">
<p>
Valgrind 支持很多工具：memcheck，addrcheck，cachegrind，Massif，helgrind 和 Callgrind 等。在运行 Valgrind 时，你必须指明想用的工具,如果省略工具名，默认运行 memcheck。
</p>
</div>
<div id="outline-container-org5823c6e" class="outline-3">
<h3 id="org5823c6e"><span class="section-number-3">2.1</span> memcheck</h3>
<div class="outline-text-3" id="text-2-1">
<p>
memcheck 探测程序中内存管理存在的问题。它检查所有对内存的读/写操作，并截取所有的 malloc/new/free/delete 调用。因此 memcheck 工具能够探测到以下问题：
</p>
<ul class="org-ul">
<li>使用未初始化的内存</li>
<li>读/写已经被释放的内存</li>
<li>读/写内存越界</li>
<li>读/写不恰当的内存栈空间</li>
<li>内存泄漏</li>
<li>使用 <code>malloc/new/new[]</code> 和 <code>free/delete/delete[]</code> 不匹配。</li>
<li>src 和 dst 的重叠</li>
</ul>
</div>
</div>
<div id="outline-container-org91fa15a" class="outline-3">
<h3 id="org91fa15a"><span class="section-number-3">2.2</span> cachegrind</h3>
<div class="outline-text-3" id="text-2-2">
<p>
cachegrind 是一个 cache 剖析器。它模拟执行 CPU 中的 L1, D1 和 L2 cache，因此它能很精确的指出代码中的 cache 未命中。如果你需要，它可以打印出 cache 未命中的次数，内存引用和发生 cache 未命中的每一行代码，每一个函数，每一个模块和整个程序的摘要。如果你要求更细致的信息，它可以打印出每一行机器码的未命中次数。在 x86 和 amd64 上，cachegrind 通过 CPUID 自动探测机器的 cache 配置，所以在多数情况下它不再需要更多的配置信息了。
</p>
</div>
</div>
<div id="outline-container-org1597144" class="outline-3">
<h3 id="org1597144"><span class="section-number-3">2.3</span> helgrind</h3>
<div class="outline-text-3" id="text-2-3">
<p>
它主要用来检查多线程程序中出现的竞争问题。Helgrind 寻找内存中被多个线程访问，而又没有一贯加锁的区域，这些区域往往是线程之间失去同步的地方，而且会导致难以发掘的错误。Helgrind 实现了名为”Eraser” 的竞争检测算法，并做了进一步改进，减少了报告错误的次数。
</p>
</div>
</div>
<div id="outline-container-orge4fe75a" class="outline-3">
<h3 id="orge4fe75a"><span class="section-number-3">2.4</span> Callgrind</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Callgrind 收集程序运行时的一些数据，函数调用关系等信息，还可以有选择地进行 cache 模拟。在运行结束时，它会把分析数据写入一个文件。 <code>callgrind_annotate</code> 可以把这个文件的内容转化成可读的形式。
</p>

<p>
一般用法:
</p>

<div class="org-src-container">
<pre class="src src-sh">       valgrind --tool=callgrind ./sec_infod
</pre>
</div>

<p>
会在当前目录下生成 <code>callgrind.out.[pid]</code>, 如果我们想结束程序, 可以
</p>

<div class="org-src-container">
<pre class="src src-sh">       killall callgrind
</pre>
</div>

<p>
然后我们可以用
</p>

<div class="org-src-container">
<pre class="src src-sh">       callgrind_annotate --auto=yes callgrind.out.[pid] &gt; log
       vi log
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f9d6a0" class="outline-3">
<h3 id="org2f9d6a0"><span class="section-number-3">2.5</span> Massif</h3>
<div class="outline-text-3" id="text-2-5">
<p>
堆栈分析器，它能测量程序在堆栈中使用了多少内存，告诉我们堆块，堆管理块和栈的大小。Massif 能帮助我们减少内存的使用，在带有虚拟内存的现代系统中，它还能够加速我们程序的运行，减少程序停留在交换区中的几率。
</p>
</div>
</div>
<div id="outline-container-org1eb30f5" class="outline-3">
<h3 id="org1eb30f5"><span class="section-number-3">2.6</span> lackey</h3>
<div class="outline-text-3" id="text-2-6">
<p>
lackey 是一个示例程序，以其为模版可以创建你自己的工具。在程序结束后，它打印出一些基本的关于程序执行统计数据。
</p>
</div>
</div>
</div>
<div id="outline-container-org4e615f1" class="outline-2">
<h2 id="org4e615f1"><span class="section-number-2">3</span> Valgrind 的参数</h2>
<div class="outline-text-2" id="text-3">
<p>
用法:
</p>
<pre class="example">
      valgrind [options] prog-and-args [options]:
</pre>
</div>

<div id="outline-container-org087b1f4" class="outline-3">
<h3 id="org087b1f4"><span class="section-number-3">3.1</span> 常用选项</h3>
<div class="outline-text-3" id="text-3-1">
<p>
适用于所有 Valgrind 工具。
</p>
<ul class="org-ul">
<li><code>--tool=&lt;name&gt;</code>
最常用的选项。运行 valgrind 中名为 toolname 的工具。默认 memcheck。</li>
<li><p>
<code>-h --help</code>
</p>

<p>
显示所有选项的帮助，包括内核和选定的工具两者。
</p></li>
<li><p>
<code>--version</code>
</p>

<p>
显示 valgrind 内核的版本，每个工具都有各自的版本。
</p></li>
<li><p>
<code>-q --quiet</code>
</p>

<p>
安静地运行，只打印错误信息。
</p></li>
<li><p>
<code>--verbose</code>
</p>

<p>
更详细的信息。
</p></li>

<li><p>
<code>--trace-children=&lt;yes|no&gt;</code>
</p>

<p>
跟踪子线程?  <code>[default: no]</code>
</p></li>

<li><p>
<code>--track-fds=&lt;yes|no&gt;</code>
</p>

<p>
跟踪打开的文件描述？ <code>[default: no]</code>
</p></li>

<li><p>
<code>--time-stamp=&lt;yes|no&gt;</code>
</p>

<p>
增加时间戳到 LOG 信息? <code>[default: no]</code>
</p></li>

<li><p>
<code>--log-fd=&lt;number&gt;</code>
</p>

<p>
输出 LOG 到描述符文件 [2=stderr]
</p></li>

<li><p>
<code>--log-file=&lt;file&gt;</code>
</p>

<p>
将输出的信息写入到 filename.PID 的文件里，PID 是运行程序的进行 ID
</p></li>

<li><p>
<code>--log-file-exactly=&lt;file&gt;</code>
</p>

<p>
输出 LOG 信息到 file,LOG 信息输出
</p></li>

<li><p>
<code>--xml=yes</code>
</p>

<p>
将信息以 xml 格式输出，只有 memcheck 可用
</p></li>

<li><p>
<code>--num-callers=&lt;number&gt;</code>
</p>

<p>
show &lt;number&gt; callers in stack traces
</p></li>

<li><p>
<code>--error-exitcode=&lt;number&gt;</code>
</p>

<p>
如果发现错误则返回错误代码 [0=disable]
</p></li>

<li><p>
<code>--db-attach=&lt;yes|no&gt;</code>
</p>

<p>
当出现错误，valgrind 会自动启动调试器 gdb。[default: no]
</p></li>

<li><p>
<code>--db-command=&lt;command&gt;</code>
</p>

<p>
启动调试器的命令行选项[gdb -nw %f %p]
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgdc44a44" class="outline-3">
<h3 id="orgdc44a44"><span class="section-number-3">3.2</span> 适用于 Memcheck 工具的相关选项：</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><p>
<code>--leak-check=&lt;no|summary|full&gt;</code>
</p>

<p>
要求对 leak 给出详细信息? Leak 是指，存在一块没有被引用的内存空间，或没有被释放的内存空间，如 summary，只反馈一些总结信息，告诉你有多少个 malloc，多少个 free 等；如果是 full 将输出所有的 leaks，也就是定位到某一个 malloc/free。
</p></li>

<li><p>
<code>--show-reachable=&lt;yes|no&gt;</code>
</p>

<p>
如果为 no，只输出没有引用的内存 leaks，或指向 malloc 返回的内存块中部某处的 leaks [default: no]
</p></li>
</ul>

<p>
更详细的参数指令见附录 A。
</p>
</div>
</div>
</div>
<div id="outline-container-orgdd385f9" class="outline-2">
<h2 id="orgdd385f9"><span class="section-number-2">4</span> Valgrind 的使用</h2>
<div class="outline-text-2" id="text-4">
<p>
首先，在编译程序的时候打开调试模式（gcc 编译器的-g 选项）。如果没有调试信息，即使最好的 valgrind 工具也将中能够猜测特定的代码是属于哪一个函数。打开调试选项进行编译后再用 valgrind 检查，valgrind 将会给你的个详细的报告，比如哪一行代码出现了内存泄漏。
</p>

<p>
当检查的是 C++程序的时候，还应该考虑另一个选项 -fno-inline。它使得函数调用链很清晰，这样可以减少你在浏览大型 C++程序时的混乱。比如在使用这个选项的时候，用 memcheck 检查 openoffice 就很容易。当然，你可能不会做这项工作，但是使用这一选项使得 valgrind 生成更精确的错误报告和减少混乱。
</p>

<p>
一些编译优化选项(比如-O2 或者更高的优化选项)，可能会使得 memcheck 提交错误的未初始化报告，因此，为了使得 valgrind 的报告更精确，在编译的时候最好不要使用优化选项。
</p>

<p>
如果程序是通过脚本启动的，可以修改脚本里启动程序的代码，或者使用 <code>--trace-children=yes</code> 选项来运行脚本。
</p>
</div>
</div>
<div id="outline-container-org648fbf8" class="outline-2">
<h2 id="org648fbf8"><span class="section-number-2">5</span> Valgrind 的示例</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org50cde4a" class="outline-3">
<h3 id="org50cde4a"><span class="section-number-3">5.1</span> 使用未初始化的内存</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d18aff;">       #include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
       <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
       {
           <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">x</span>;
           <span style="color: #a1db00;">if</span>(x == 0) {
               printf(<span style="color: #ff4ea3;">"X is zero"</span>);
           }
           <span style="color: #a1db00;">return</span> 0;
       }
</pre>
</div>

<p>
运行：
</p>
<div class="org-src-container">
<pre class="src src-sh">      gcc -g uninit-mem.c -o uninit-mem
      valgrind  --tool=memcheck ./uninit-mem
</pre>
</div>

<p>
我们可以看到:
</p>
<ul class="org-ul">
<li>左边显示类似行号的数字（10297）表示的是 Process ID。</li>
<li>最上面的红色方框表示的是 valgrind 的版本信息。</li>
<li>中间的红色方框表示 valgrind 通过运行被测试程序，发现的内存问题。通过阅读这些信息，可以发现：
<ul class="org-ul">
<li>这是一个对内存的非法写操作，非法写操作的内存是 4 bytes。</li>
<li>发生错误时的函数堆栈，以及具体的源代码行号。</li>
<li>非法写操作的具体地址空间。</li>
</ul></li>
<li>最下面的红色方框是对发现的内存问题和内存泄漏问题的总结。内存泄漏的大小（40 bytes）也能够被检测出来。</li>
</ul>
</div>
