content/software-engineering/debug/valgrind-practices.org
*** 内存读写越界
   	#+BEGIN_SRC c
       	#include <stdlib.h>
       	#include <stdio.h>

       	int main(int argc,char *argv[])
       	{
           	int len=5;
           	int i;
           	int *pt=(int*)malloc(len*sizeof(int));
           	int *p=pt;
           	for(i=0;i<len;i++)
           	{p++;}
           	,*p=5;
           	printf(“%d”,*p);

           	return;
       	}
   	#+END_SRC

   	#+BEGIN_SRC sh :export both

   	#+END_SRC

*** src 和 dst 内存覆盖
   	#+BEGIN_SRC c
       	#include <stdlib.h>
       	#include <stdio.h>
       	#include <string.h>

       	int main(int argc,char *argv[])
       	{
           	char x[50];
           	int i;
           	for(i=0;i<50;i++)
           	{
               	x[i]=i;
           	}
           	strncpy(x+20,x,20); //Good
           	strncpy(x+20,x,21); //Overlap
           	x[39]=’\0’;
           	strcpy(x,x+20); //Good
           	x[39]=40;
           	x[40]=’\0’;
           	strcpy(x,x+20); //Overlap

           	return 0;

       	}
   	#+END_SRC

*** 动态内存管理错误
   	常见的内存分配方式分三种：静态存储，栈上分配，堆上分配。全局变量属于静态存储，它们是在编译时就被分配了存储空间，函数内的局部变量属于栈上分配，而最灵活的内存使用方式当属堆上分配，也叫做内存动态分配了。常用的内存动态分配函数包括：malloc, alloc, realloc, new 等，动态释放函数包括 free, delete。

   	一旦成功申请了动态内存，我们就需要自己对其进行内存管理，而这又是最容易犯错误的。常见的内存动态管理错误包括：
   	+ 申请和释放不一致
   	+ 由于 C++ 兼容 C，而 C 与 C++ 的内存申请和释放函数是不同的，因此在 C++ 程序中，就有两套动态内存管理函数。一条不变的规则就是采用 C 方式申请的内存就用 C 方式释放；用 C++ 方式申请的内存，用 C++ 方式释放。也就是用 malloc/alloc/realloc 方式申请的内存，用 free 释放；用 new 方式申请的内存用 delete 释放。在上述程序中，用 malloc 方式申请了内存却用 delete 来释放，虽然这在很多情况下不会有问题，但这绝对是潜在的问题。
   	+ 申请和释放不匹配
   	+ 申请了多少内存，在使用完成后就要释放多少。如果没有释放，或者少释放了就是内存泄露；多释放了也会产生问题。上述程序中，指针 p 和 pt 指向的是同一块内存，却被先后释放两次。
   	+ 释放后仍然读写，本质上说，系统会在堆上维护一个动态内存链表，如果被释放，就意味着该块内存可以继续被分配给其他部分，如果内存被释放后再访问，就可能覆盖其他部分的信息，这是一种严重的错误。

   	下面的一段程序，就包括了内存动态管理中常见的错误。
   	#+BEGIN_SRC c
       	#include <stdlib.h>
       	#include <stdio.h>

       	int main(int argc,char *argv[])
       	{
           	char *p=(char*)malloc(10);
           	char *pt=p;
           	int i;
           	for(i=0;i<10;i++)
           	{
               	p[i]=’z’;
           	}
           	delete p;
           	p[1]=’a’;
           	free(pt);

           	return 0;

       	}
   	#+END_SRC


*** 内存泄漏
   	#+BEGIN_SRC c
       	#include <stdlib.h>

       	int main()
       	{
           	char *x = (char*)malloc(20);
           	char *y = (char*)malloc(20);
           	x=y;
           	free(x);
           	free(y);

           	return 0;

       	}
   	#+END_SRC


*** 非法读写
   	#+BEGIN_SRC c
       	int main()
       	{
           	int i, *x;
           	x = (int *)malloc(10*sizeof(int));
           	for (i=0; i<11; i++)
               	x[i] = i;
           	free(x);

           	return 0;
       	}
   	#+END_SRC

*** 无效指针
   	#+BEGIN_SRC c
       	#include <stdlib.h>

       	int main()
       	{
           	char *x = malloc(10);
           	x[10] = 'a';
           	free(x);

           	return 0;

       	}
   	#+END_SRC

*** 重复释放
   	#+BEGIN_SRC c
       	#include <stdlib.h>

       	int main(int argc, char *argv[])
       	{
           	char *x = malloc(10);
           	free(x);
           	free(x);

           	return 0;
       	}
   	#+END_SRC

* Valgrind 的局限
  Valgrind 不对静态数组 (分配在栈上) 进行边界检查。如果在程序中声明了一个数组:
  #+BEGIN_SRC c
      int main(int argc, char *argv[])
      {
          char x[10];
          x[11] = 'a';
          return 0;
      }

  #+END_SRC

  Valgrind 则不会警告你，你可以把数组改为动态在堆上分配的数组，这样就可能进行边界检查了。这个方法好像有点得不偿失的感觉。

  Valgrind 占用了更多的内存---可达两倍于你程序的正常使用量。如果你用 Valgrind 来检测使用大量内存的程序就会遇到问题，它可能会用很长的时间来运行测试。大多数情况下，这都不是问题，即使速度慢也仅是检测时速度慢，如果你用 Valgrind 来检测一个正常运行时速度就很慢的程序，这下问题就大了。Valgrind 不可能检测出你在程序中犯下的所有错误---如果你不检查缓冲区溢出，Valgrind 也不会告诉你代码写了它不应该写的内存。

* 附录 A：参数指令
