software-engineering/debug/valgrind-practices.html

<div id="outline-container-orgbb50d61" class="outline-4">
<h4 id="orgbb50d61"><span class="section-number-4">5.1.1</span> 内存读写越界</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>

        <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
        {
            <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">len</span>=5;
            <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span>;
            <span style="color: #00d7af;">int</span> *<span style="color: #ff8700;">pt</span>=(<span style="color: #00d7af;">int</span>*)malloc(<span style="color: #00d7af;">len</span>*<span style="color: #a1db00;">sizeof</span>(<span style="color: #00d7af;">int</span>));
            <span style="color: #00d7af;">int</span> *<span style="color: #ff8700;">p</span>=pt;
            <span style="color: #a1db00;">for</span>(i=0;i&lt;len;i++)
            {p++;}
            *p=5;
            printf(&#8220;%d&#8221;,*p);

            <span style="color: #a1db00;">return</span>;
        }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>
</div>
</div>

<div id="outline-container-org6caf18d" class="outline-4">
<h4 id="org6caf18d"><span class="section-number-4">5.1.2</span> src 和 dst 内存覆盖</h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>

        <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
        {
            <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">x</span>[50];
            <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span>;
            <span style="color: #a1db00;">for</span>(i=0;i&lt;50;i++)
            {
                x[i]=i;
            }
            strncpy(x+20,x,20); <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">Good</span>
            strncpy(x+20,x,21); <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">Overlap</span>
            x[39]=&#8217;\0&#8217;;
            strcpy(x,x+20); <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">Good</span>
            x[39]=40;
            x[40]=&#8217;\0&#8217;;
            strcpy(x,x+20); <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">Overlap</span>

            <span style="color: #a1db00;">return</span> 0;

        }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0e9bad" class="outline-4">
<h4 id="orgc0e9bad"><span class="section-number-4">5.1.3</span> 动态内存管理错误</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
常见的内存分配方式分三种：静态存储，栈上分配，堆上分配。全局变量属于静态存储，它们是在编译时就被分配了存储空间，函数内的局部变量属于栈上分配，而最灵活的内存使用方式当属堆上分配，也叫做内存动态分配了。常用的内存动态分配函数包括：malloc, alloc, realloc, new 等，动态释放函数包括 free, delete。
</p>

<p>
一旦成功申请了动态内存，我们就需要自己对其进行内存管理，而这又是最容易犯错误的。常见的内存动态管理错误包括：
</p>
<ul class="org-ul">
<li>申请和释放不一致</li>
<li>由于 C++ 兼容 C，而 C 与 C++ 的内存申请和释放函数是不同的，因此在 C++ 程序中，就有两套动态内存管理函数。一条不变的规则就是采用 C 方式申请的内存就用 C 方式释放；用 C++ 方式申请的内存，用 C++ 方式释放。也就是用 malloc/alloc/realloc 方式申请的内存，用 free 释放；用 new 方式申请的内存用 delete 释放。在上述程序中，用 malloc 方式申请了内存却用 delete 来释放，虽然这在很多情况下不会有问题，但这绝对是潜在的问题。</li>
<li>申请和释放不匹配</li>
<li>申请了多少内存，在使用完成后就要释放多少。如果没有释放，或者少释放了就是内存泄露；多释放了也会产生问题。上述程序中，指针 p 和 pt 指向的是同一块内存，却被先后释放两次。</li>
<li>释放后仍然读写，本质上说，系统会在堆上维护一个动态内存链表，如果被释放，就意味着该块内存可以继续被分配给其他部分，如果内存被释放后再访问，就可能覆盖其他部分的信息，这是一种严重的错误。</li>
</ul>

<p>
下面的一段程序，就包括了内存动态管理中常见的错误。
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>

        <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
        {
            <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">p</span>=(<span style="color: #00d7af;">char</span>*)malloc(10);
            <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">pt</span>=p;
            <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span>;
            <span style="color: #a1db00;">for</span>(i=0;i&lt;10;i++)
            {
                p[i]=&#8217;z&#8217;;
            }
            <span style="color: #00d7af;">delete</span> <span style="color: #ff8700;">p</span>;
            p[1]=&#8217;a&#8217;;
            free(pt);

            <span style="color: #a1db00;">return</span> 0;

        }
</pre>
</div>
</div>
</div>


<div id="outline-container-orgdcf5477" class="outline-4">
<h4 id="orgdcf5477"><span class="section-number-4">5.1.4</span> 内存泄漏</h4>
<div class="outline-text-4" id="text-5-1-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>

        <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>()
        {
            <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">x</span> = (<span style="color: #00d7af;">char</span>*)malloc(20);
            <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">y</span> = (<span style="color: #00d7af;">char</span>*)malloc(20);
            x=y;
            free(x);
            free(y);

            <span style="color: #a1db00;">return</span> 0;

        }
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc45e04b" class="outline-4">
<h4 id="orgc45e04b"><span class="section-number-4">5.1.5</span> 非法读写</h4>
<div class="outline-text-4" id="text-5-1-5">
<div class="org-src-container">
<pre class="src src-c">        <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>()
        {
            <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span>, *<span style="color: #ff8700;">x</span>;
            x = (<span style="color: #00d7af;">int</span> *)malloc(10*<span style="color: #a1db00;">sizeof</span>(<span style="color: #00d7af;">int</span>));
            <span style="color: #a1db00;">for</span> (i=0; i&lt;11; i++)
                x[i] = i;
            free(x);

            <span style="color: #a1db00;">return</span> 0;
        }
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3e58b6" class="outline-4">
<h4 id="orge3e58b6"><span class="section-number-4">5.1.6</span> 无效指针</h4>
<div class="outline-text-4" id="text-5-1-6">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>

        <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>()
        {
            <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">x</span> = malloc(10);
            x[10] = <span style="color: #ff4ea3;">'a'</span>;
            free(x);

            <span style="color: #a1db00;">return</span> 0;

        }
</pre>
</div>
</div>
</div>

<div id="outline-container-org05bac9e" class="outline-4">
<h4 id="org05bac9e"><span class="section-number-4">5.1.7</span> 重复释放</h4>
<div class="outline-text-4" id="text-5-1-7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #d18aff;">        #include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>

        <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
        {
            <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">x</span> = malloc(10);
            free(x);
            free(x);

            <span style="color: #a1db00;">return</span> 0;
        }
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc482202" class="outline-2">
<h2 id="orgc482202"><span class="section-number-2">6</span> Valgrind 的局限</h2>
<div class="outline-text-2" id="text-6">
<p>
Valgrind 不对静态数组 (分配在栈上) 进行边界检查。如果在程序中声明了一个数组:
</p>
<div class="org-src-container">
<pre class="src src-c">      <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
      {
          <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">x</span>[10];
          x[11] = <span style="color: #ff4ea3;">'a'</span>;
          <span style="color: #a1db00;">return</span> 0;
      }

</pre>
</div>

<p>
Valgrind 则不会警告你，你可以把数组改为动态在堆上分配的数组，这样就可能进行边界检查了。这个方法好像有点得不偿失的感觉。
</p>

<p>
Valgrind 占用了更多的内存&#x2014;可达两倍于你程序的正常使用量。如果你用 Valgrind 来检测使用大量内存的程序就会遇到问题，它可能会用很长的时间来运行测试。大多数情况下，这都不是问题，即使速度慢也仅是检测时速度慢，如果你用 Valgrind 来检测一个正常运行时速度就很慢的程序，这下问题就大了。Valgrind 不可能检测出你在程序中犯下的所有错误&#x2014;如果你不检查缓冲区溢出，Valgrind 也不会告诉你代码写了它不应该写的内存。
</p>
</div>
</div>
