software-engineering/debug/valgrind-practices.html

<div id="outline-container-org9b75b1d" class="outline-2">
<h2 id="org9b75b1d"><span class="section-number-2">7</span> 附录 A：参数指令</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org3bf84c4" class="outline-3">
<h3 id="org3bf84c4"><span class="section-number-3">7.1</span> 基本选项：</h3>
<div class="outline-text-3" id="text-7-1">
<p>
这些选项对所有工具都有效。
</p>
<ul class="org-ul">
<li><p>
-h  <code>--help</code>
</p>

<p>
显示所有选项的帮助，包括内核和选定的工具两者。
</p></li>

<li><p>
<code>--help-debug</code>
</p>

<p>
和  <code>--help</code> 相同，并且还能显示通常只有 Valgrind 的开发人员使用的调试选项。
</p></li>

<li><p>
<code>--version</code>
</p>

<p>
显示 Valgrind 内核的版本号。工具可以有他们自已的版本号。这是一种保证工具只在它们可以运行的内核上工作的一种设置。这样可以减少在工具和内核之间版本兼容性导致奇怪问题的概率。
</p></li>

<li><p>
-q  <code>--quiet</code>
</p>

<p>
安静的运行，只打印错误信息。在进行回归测试或者有其它的自动化测试机制时会非常有用。
</p></li>

<li><p>
-v  <code>--verbose</code>
</p>

<p>
显示详细信息。在各个方面显示你的程序的额外信息，例如：共享对象加载，使用的重置，执行引擎和工具的进程，异常行为的警告信息。重复这个标记可以增加详细的级别。
</p></li>

<li><p>
-d
</p>

<p>
调试 Valgrind 自身发出的信息。通常只有 Valgrind 开发人员对此感兴趣。重复这个标记可以产生更详细的输出。如果你希望发送一个 bug 报告，通过 - v -v -d -d 生成的输出会使你的报告更加有效。
</p></li>

<li><p>
<code>--tool=&lt;toolname&gt; [default: memcheck]</code>
</p>

<p>
运行 toolname 指定的 Valgrind，例如，Memcheck, Addrcheck, Cachegrind, 等等。
</p></li>

<li><p>
<code>--trace-children=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项打开时，Valgrind 会跟踪到子进程中。这经常会导致困惑，而且通常不是你所期望的，所以默认这个选项是关闭的。
</p></li>

<li><p>
<code>--track-fds=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项打开时，Valgrind 会在退出时打印一个打开文件描述符的列表。每个文件描述符都会打印出一个文件是在哪里打开的栈回溯，和任何与此文件描述符相关的详细信息比如文件名或 socket 信息。
</p></li>

<li><p>
<code>--time-stamp=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项打开时，每条信息之前都有一个从程序开始消逝的时间，用天，小时，分钟，秒和毫秒表示。
</p></li>

<li><p>
<code>--log-fd=&lt;number&gt; [default: 2, stderr]</code>
</p>

<p>
指定 Valgrind 把它所有的消息都输出到一个指定的文件描述符中去。默认值 2, 是标准错误输出 (stderr)。注意这可能会干扰到客户端自身对 stderr 的使用, Valgrind 的输出与客户程序的输出将穿插在一起输出到 stderr。
</p></li>

<li><p>
<code>--log-file=&lt;filename&gt;</code>
</p>

<p>
指定 Valgrind 把它所有的信息输出到指定的文件中。实际上，被创建文件的文件名是由 filename、'.'和进程号连接起来的（即 &lt;filename&gt;.&lt;pid&gt;），从而每个进程创建不同的文件。
</p></li>

<li><p>
<code>--log-file-exactly=&lt;filename&gt;</code>
</p>

<p>
类似于  ~&#x2013;log-file，但是后缀 ".pid" 不会被添加。如果设置了这个选项，使用 Valgrind 跟踪多个进程，可能会得到一个乱七八糟的文件。
</p></li>

<li><p>
<code>--log-file-qualifier=&lt;VAR&gt;</code>
</p>

<p>
当和  ~&#x2013;log-file 一起使用时，日志文件名将通过环境变量 $VAR 来筛选。这对于 MPI 程序是有益的。更多的细节，查看手册 2.3 节 "注解"。
</p></li>

<li><p>
<code>--log-socket=&lt;ip-address:port-number&gt;</code>
</p>

<p>
指定 Valgrind 输出所有的消息到指定的 IP，指定的端口。当使用 1500 端口时，端口有可能被忽略。如果不能建立一个到指定端口的连接，Valgrind 将输出写到标准错误 (stderr)。这个选项经常和一个 Valgrind 监听程序一起使用。更多的细节，查看手册 2.3 节 "注解"。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org415b5b0" class="outline-3">
<h3 id="org415b5b0"><span class="section-number-3">7.2</span> 错误相关选项：</h3>
<div class="outline-text-3" id="text-7-2">
<p>
这些选项适用于所有产生错误的工具，比如 Memcheck, 但是 Cachegrind 不行。
</p>
<ul class="org-ul">
<li><p>
<code>--xml=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项打开时，输出将是 XML 格式。这是为了使用 Valgrind 的输出做为输入的工具，例如 GUI 前端更加容易些。目前这个选项只在 Memcheck 时生效。
</p></li>

<li><p>
<code>--xml-user-comment=&lt;string&gt;</code>
</p>

<p>
在 XML 开头 附加用户注释，仅在指定了  <code>--xml=yes</code> 时生效，否则忽略。
</p></li>

<li><p>
<code>--demangle=&lt;yes|no&gt; [default: yes]</code>
</p>

<p>
打开 / 关闭 C++ 的名字自动解码。默认打开。当打开时，Valgrind 将尝试着把编码过的 C++ 名字自动转回初始状态。这个解码器可以处理 g++ 版本为 2.X,3.X 或 4.X 生成的符号。一个关于名字编码解码重要的事实是，禁止文件中的解码函数名仍然使用他们未解码的形式。Valgrind 在搜寻可用的禁止条目时不对函数名解码，因为这将使禁止文件内容依赖于 Valgrind 的名字解码机制状态，会使速度变慢，且无意义。
</p></li>

<li><p>
~ <code>--num-callers=&lt;number&gt; [default: 12]</code>
</p>

<p>
默认情况下，Valgrind 显示 12 层函数调用的函数名有助于确定程序的位置。可以通过这个选项来改变这个数字。这样有助在嵌套调用的层次很深时确定程序的位置。注意错误信息通常只回溯到最顶上的 4 个函数。(当前函数，和它的 3 个调用者的位置)。所以这并不影响报告的错误总数。这个值的最大值是 50。注意高的设置会使 Valgrind 运行得慢，并且使用更多的内存, 但是在嵌套调用层次比较高的程序中非常实用。
</p></li>

<li><p>
<code>--error-limit=&lt;yes|no&gt; [default: yes]</code>
</p>

<p>
当这个选项打开时，在总量达到 10,000,000，或者 1,000 个不同的错误，Valgrind 停止报告错误。这是为了避免错误跟踪机制在错误很多的程序下变成一个巨大的性能负担。
</p></li>

<li><p>
<code>--error-exitcode=&lt;number&gt; [default: 0]</code>
</p>

<p>
指定如果 Valgrind 在运行过程中报告任何错误时的退出返回值，有两种情况；当设置为默认值 (零) 时，Valgrind 返回的值将是它模拟运行的程序的返回值。当设置为非零值时，如果 Valgrind 发现任何错误时则返回这个值。在 Valgrind 做为一个测试工具套件的部分使用时这将非常有用，因为使测试工具套件只检查 Valgrind 返回值就可以知道哪些测试用例 Valgrind 报告了错误。
</p></li>

<li><p>
<code>--show-below-main=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
默认地，错误时的栈回溯不显示 main()之下的任何函数 (或者类似的函数像 glibc 的__libc_start_main()，如果 main() 没有出现在栈回溯中)；这些大部分都是令人厌倦的 C 库函数。如果打开这个选项，在 main()之下的函数也将会显示。
</p></li>

<li><p>
<code>--suppressions=&lt;filename&gt; [default: $PREFIX/lib/valgrind/default.supp]</code>
</p>

<p>
指定一个额外的文件读取不需要理会的错误；你可以根据需要使用任意多的额外文件。
</p></li>

<li><p>
<code>--gen-suppressions=&lt;yes|no|all&gt; [default: no]</code>
</p>

<p>
当设置为 yes 时，Valgrind 将会在每个错误显示之后自动暂停并且打印下面这一行： <code>--Print suppression ?  ~--- [Return/N/n/Y/y/C/c]</code> 个提示的行为和  <code>--db-attach</code> 选项 (见下面) 相同。如果选择是，Valgrind 会打印出一个错误的禁止条目，你可以把它剪切然后粘帖到一个文件，如果不希望在将来再看到这个错误信息。当设置为 all 时，Valgrind 会对每一个错误打印一条禁止条目，而不向用户询问。这个选项对 C++ 程序非常有用，它打印出编译器调整过的名字。注意打印出来的禁止条目是尽可能的特定的。如果需要把类似的条目归纳起来，比如在函数名中添加通配符。并且，有些时候两个不同的错误也会产生同样的禁止条目，这时 Valgrind 就会输出禁止条目不止一次，但是在禁止条目的文件中只需要一份拷贝(但是如果多于一份也不会引起什么问题)。并且，禁止条目的名字像&lt;在这儿输入一个禁止条目的名字&gt;; 名字并不是很重要，它只是和 - v 选项一起使用打印出所有使用的禁止条目记录。
</p></li>

<li><p>
<code>--db-attach=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项打开时，Valgrind 将会在每次打印错误时暂停并打出如下一行： <code>-- Attach to debugger ?  - [Return/N/n/Y/y/C/c]</code> 按下回车, 或者 N、回车，n、回车，Valgrind 不会对这个错误启动调试器。按下 Y、回车，或者 y、回车，Valgrind 会启动调试器并设定在程序运行的这个点。当调试结束时，退出，程序会继续运行。在调试器内部尝试继续运行程序，将不会生效。按下 C、回车，或者 c、回车，Valgrind 不会启动一个调试器，并且不会再次询问。注意： <code>--db-attach=yes</code> 与  <code>--trace-children=yes</code> 有冲突。你不能同时使用它们。Valgrind 在这种情况下不能启动。
</p></li>

<li><p>
<code>--db-command=&lt;command&gt; [default: gdb -nw %f %p]</code>
</p>

<p>
通过  <code>--db-attach</code> 指定如何使用调试器。默认的调试器是 gdb. 默认的选项是一个运行时扩展 Valgrind 的模板。 %f 会用可执行文件的文件名替换，%p 会被可执行文件的进程 ID 替换。这指定了 Valgrind 将怎样调用调试器。默认选项不会因为在构造时是否检测到了 GDB 而改变, 通常是 /usr/bin/gdb. 使用这个命令，你可以指定一些调用其它的调试器来替换。给出的这个命令字串可以包括一个或多个 %p %f 扩展。每一个 %p 实例都被解释成将调试的进程的 PID，每一个 %f 实例都被解释成要调试的进程的可执行文件路径。
</p></li>

<li><p>
<code>--input-fd=&lt;number&gt; [default: 0, stdin]</code>
</p>

<p>
使用  <code>--db-attach=yes</code> 和  <code>--gen-suppressions=yes</code> 选项，在发现错误时，Valgrind 会停下来去读取键盘输入。默认地，从标准输入读取，所以关闭了标准输入的程序会有问题。这个选项允许你指定一个文件描述符来替代标准输入读取。
</p></li>

<li><p>
<code>--max-stackframe=&lt;number&gt; [default: 2000000]</code>
</p>

<p>
栈的最大值。如果栈指针的偏移超过这个数量，Valgrind 则会认为程序是切换到了另外一个栈执行。如果在程序中有大量的栈分配的数组，你可能需要使用这个选项。valgrind 保持对程序栈指针的追踪。如果栈指针的偏移超过了这个数量，Valgrind 假定你的程序切换到了另外一个栈，并且 Memcheck 行为与栈指针的偏移没有超出这个数量将会不同。通常这种机制运转得很好。然而，如果你的程序在栈上申请了大的结构，这种机制将会表现得愚蠢，并且 Memcheck 将会报告大量的非法栈内存访问。这个选项允许把这个阀值设置为其它值。应该只在 Valgrind 的调试输出中显示需要这么做时才使用这个选项。在这种情况下，它会告诉你应该指定的新的阀值。普遍地，在栈中分配大块的内存是一个坏的主意。因为这很容易用光你的栈空间，尤其是在内存受限的系统或者支持大量小堆栈的线程的系统上，因为 Memcheck 执行的错误检查，对于堆上的数据比对栈上的数据要高效很多。如果你使用这个选项，你可能希望考虑重写代码在堆上分配内存而不是在栈上分配。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org3df8ef5" class="outline-3">
<h3 id="org3df8ef5"><span class="section-number-3">7.3</span> MALLOC() 相关的选项:</h3>
<div class="outline-text-3" id="text-7-3">
<p>
对于使用自有版本的 malloc() (例如 Memcheck 和 massif)，下面的选项可以使用。
</p>
<ul class="org-ul">
<li><p>
<code>--alignment=&lt;number&gt; [default: 8]</code>
</p>

<p>
默认 Valgrind 的 malloc(),realloc(), 等等，是 8 字节对齐地址的。这是大部分处理器的标准。然而，一些程序可能假定 malloc() 等总是返回 16 字节或更多对齐的内存。提供的数值必须在 8 和 4096 区间之内，并且必须是 2 的幂数。
</p></li>
</ul>
</div>
</div>
