software-engineering/debug/valgrind-practices.html

<div id="outline-container-orge6aeced" class="outline-3">
<h3 id="orge6aeced"><span class="section-number-3">7.4</span> 非通用选项：</h3>
<div class="outline-text-3" id="text-7-4">
<p>
这些选项可以用于所有的工具，它们影响 Valgrind core 的几个特性。大部分人不会用到这些选项。
</p>
<ul class="org-ul">
<li><p>
<code>--run-libc-freeres=&lt;yes|no&gt; [default: yes]</code>
</p>

<p>
GNU C 库 (libc.so)，所有程序共用的，可能会分配一部分内存自已用。通常在程序退出时释放内存并不麻烦，这里没什么问题，因为 Linux 内核在一个进程退出时会回收进程全部的资源，所以这只是会造成速度慢。glibc 的作者认识到这样会导致内存检查器，像 Valgrind，在退出时检查内存错误的报告 glibc 的内存泄漏问题，为了避免这个问题，他们提供了一个__libc_freeres() 例程特别用来让 glibc 释放分配的所有内存。因此 Memcheck 在退出时尝试着去运行__libc_freeres()。不幸的是，在 glibc 的一些版本中，__libc_freeres 是有 bug 会导致段错误的。这在 Red Hat 7.1 上有特别声明。所以，提供这个选项来决定是否运行__libc_freeres。如果你的程序看起来在 Valgrind 上运行得很好，但是在退出时发生段错误，你可能需要指定  <code>--run-libc-freeres=no</code> 来修正，这将可能错误的报告 libc.so 的内存泄漏。
</p></li>

<li><p>
<code>--sim-hints=hint1,hint2,...</code>
</p>

<p>
传递杂凑的提示给 Valgrind，轻微的修改模拟行为的非标准或危险方式，可能有助于模拟奇怪的特性。默认没有提示打开。小心使用！目前已知的提示有：
</p>
<ul class="org-ul">
<li>lax-ioctls: 对 ioctl 的处理非常不严格，唯一的假定是大小是正确的。不需要在写时缓冲区完全的初始化。没有这个，用大量的奇怪的 ioctl 命令来使用一些设备驱动将会非常烦人。</li>
<li>enable-inner: 打开某些特殊的效果，当运行的程序是 Valgrind 自身时。</li>
</ul></li>

<li><p>
<code>--kernel-variant=variant1,variant2,...</code>
</p>

<p>
处理系统调用和 ioctls 在这个平台的默认核心上产生不同的变量。这有助于运行在改进过的内核或者支持非标准的 ioctls 上。小心使用。如果你不理解这个选项做的是什么那你几乎不需要它。已经知道的变量有：
</p>
<ul class="org-ul">
<li>bproc: 支持 X86 平台上的 sys_broc 系统调用。这是为了运行在 BProc，它是标准 Linux 的一个变种，有时用来构建集群。</li>
</ul></li>

<li><p>
<code>--show-emwarns=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项打开时，Valgrind 在一些特定的情况下将对 CPU 仿真产生警告。通常这些都是不引人注意的。
</p></li>

<li><p>
<code>--smc-check=&lt;none|stack|all&gt; [default: stack]</code>
</p>

<p>
这个选项控制 Valgrind 对自我修改的代码的检测。Valgrind 可以不做检测，可以检测栈中自我修改的代码，或者任意地方检测自我修改的代码。注意默认选项是捕捉绝大多数情况，到目前我们了解的情况为止。使用 all 选项时会极大的降低速度。(但是用 none 选项运行极少影响速度，因为对大多数程序，非常少的代码被添加到栈中)
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga2720a7" class="outline-3">
<h3 id="orga2720a7"><span class="section-number-3">7.5</span> 调试 VALGRIND 选项：</h3>
<div class="outline-text-3" id="text-7-5">
<p>
还有一些选项是用来调试 Valgrind 自身的。在运行一般的东西时不应该需要的。如果你希望看到选项列表，使用  <code>--help-debug</code> 选项。
</p>
</div>

<div id="outline-container-orga6dcfad" class="outline-4">
<h4 id="orga6dcfad"><span class="section-number-4">7.5.1</span> 内存检查选项：</h4>
<div class="outline-text-4" id="text-7-5-1">
<ul class="org-ul">
<li><p>
<code>--leak-check=&lt;no|summary|yes|full&gt; [default: summary]</code>
</p>

<p>
当这个选项打开时，当客户程序结束时查找内存泄漏。内存泄漏意味着有用 malloc 分配内存块，但是没有用 free 释放，而且没有指针指向这块内存。这样的内存块永远不能被程序释放，因为没有指针指向它们。如果设置为 summary，Valgrind 会报告有多少内存泄漏发生了。如果设置为 full 或 yes，Valgrind 给出每一个独立的泄漏的详细信息。
</p>

<ul class="org-ul">
<li><p>
<code>--show-reachable=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项关闭时，内存泄漏检测器只显示没有指针指向的内存块，或者只能找到指向块中间的指针。当这个选项打开时，内存泄漏检测器还报告有指针指向的内存块。这些块是最有可能出现内存泄漏的地方。你的程序可能，至少在原则上，应该在退出前释放这些内存块。这些有指针指向的内存块和没有指针指向的内存块，或者只有内部指针指向的块，都可能产生内存泄漏，因为实际上没有一个指向块起始的指针可以拿来释放，即使你想去释放它。
</p></li>
</ul></li>

<li><p>
<code>--leak-resolution=&lt;low|med|high&gt; [default: low]</code>
</p>

<p>
在做内存泄漏检查时，确定 memcheck 将怎么样考虑不同的栈是相同的情况。当设置为 low 时，只需要前两层栈匹配就认为是相同的情况；当设置为 med，必须要四层栈匹配，当设置为 high 时，所有层次的栈都必须匹配。对于 hardcore 内存泄漏检查，你很可能需要使用  <code>--leak-resolution=high</code> 和  <code>--num-callers=40</code> 或者更大的数字。注意这将产生巨量的信息，这就是为什么默认选项是四个调用者匹配和低分辨率的匹配。注意  <code>--leak-resolution=</code> 设置并不影响 memcheck 查找内存泄漏的能力。它只是改变了结果如何输出。
</p></li>

<li><p>
<code>--freelist-vol=&lt;number&gt; [default: 5000000]</code>
</p>

<p>
当客户程序使用 free(C 中) 或者 delete(C++) 释放内存时，这些内存并不是马上就可以用来再分配的。这些内存将被标记为不可访问的，并被放到一个已释放内存的队列中。这样做的目的是，使释放的内存再次被利用的点尽可能的晚。这有利于 memcheck 在内存块释放后这段重要的时间检查对块不合法的访问。这个选项指定了队列所能容纳的内存总容量，以字节为单位。默认的值是 5000000 字节。增大这个数目会增加 memcheck 使用的内存，但同时也增加了对已释放内存的非法使用的检测概率。
</p></li>

<li><p>
<code>--workaround-gcc296-bugs=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
当这个选项打开时，假定读写栈指针以下的一小段距离是 gcc 2.96 的 bug，并且不报告为错误。距离默认为 256 字节。注意 gcc 2.96 是一些比较老的 Linux 发行版 (RedHat 7.X) 的默认编译器，所以你可能需要使用这个选项。如果不是必要请不要使用这个选项，它可能会使一些真正的错误溜掉。一个更好的解决办法是使用较新的，修正了这个 bug 的 gcc/g++ 版本。
</p></li>

<li><p>
<code>--partial-loads-ok=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
控制 memcheck 如何处理从地址读取时字长度，字对齐，因此哪些字节是可以寻址的，哪些是不可以寻址的。当设置为 yes 是，这样的读取并不抛出一个寻址错误。而是从非法地址读取的 V 字节显示为未定义，访问合法地址仍然是像平常一样映射到内存。设置为 no 时，从部分错误的地址读取与从完全错误的地址读取同样处理：抛出一个非法地址错误，结果的 V 字节显示为合法数据。注意这种代码行为是违背 ISO C/C++ 标准，应该被认为是有问题的。如果可能，这种代码应该修正。这个选项应该只是做为一个最后考虑的方法。
</p></li>

<li><p>
<code>--undef-value-errors=&lt;yes|no&gt; [default: yes]</code>
</p>

<p>
控制 memcheck 是否检查未定义值的危险使用。当设为 yes 时，Memcheck 的行为像 Addrcheck, 一个轻量级的内存检查工具，是 Valgrind 的一个部分，它并不检查未定义值的错误。使用这个选项，如果你不希望看到未定义值错误。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org6ad326a" class="outline-4">
<h4 id="org6ad326a"><span class="section-number-4">7.5.2</span> CACHEGRIND 选项：</h4>
<div class="outline-text-4" id="text-7-5-2">
<p>
手动指定 I1/D1/L2 缓冲配置，大小是用字节表示的。这三个必须用逗号隔开，中间没有空格，例如：valgrind  <code>--tool=cachegrind --I1=65535,2,64</code> 你可以指定一个，两个或三个 I1/D1/L2 缓冲。如果没有手动指定，每个级别使用普通方式 (通过 CPUID 指令得到缓冲配置，如果失败，使用默认值) 得到的配置。
</p>

<ul class="org-ul">
<li><p>
<code>--I1=&lt;size&gt;,&lt;associativity&gt;,&lt;line size&gt;</code>
</p>

<p>
指定第一级指令缓冲的大小，关联度和行大小。
</p></li>

<li><p>
<code>--D1=&lt;size&gt;,&lt;associativity&gt;,&lt;line size&gt;</code>
</p>

<p>
指定第一级数据缓冲的大小，关联度和行大小。
</p></li>

<li><p>
<code>--L2=&lt;size&gt;,&lt;associativity&gt;,&lt;line size&gt;</code>
</p>

<p>
指定第二级缓冲的大小，关联度和行大小。
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7faf29b" class="outline-3">
<h3 id="org7faf29b"><span class="section-number-3">7.6</span> CALLGRIND 选项：</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li><p>
<code>--heap=&lt;yes|no&gt; [default: yes]</code>
</p>

<p>
当这个选项打开时，详细的追踪堆的使用情况。关闭这个选项时，massif.pid.txt 或 massif.pid.html 将会非常的简短。
</p></li>

<li><p>
<code>--heap-admin=&lt;number&gt; [default: 8]</code>
</p>

<p>
每个块使用的管理字节数。这只能使用一个平均的估计值，因为它可能变化。glibc 使用的分配器每块需要 4~15 字节，依赖于各方面的因素。管理已经释放的块也需要空间，尽管 massif 不计算这些。
</p></li>

<li><p>
<code>--stacks=&lt;yes|no&gt; [default: yes]</code>
</p>

<p>
当打开时，在剖析信息中包含栈信息。多线程的程序可能有多个栈。
</p></li>

<li><p>
<code>--depth=&lt;number&gt; [default: 3]</code>
</p>

<p>
详细的堆信息中调用过程的深度。增加这个值可以给出更多的信息，但是 massif 会更使这个程序运行得慢，使用更多的内存，并且产生一个大的 massif.pid.txt 或者 massif.pid.hp 文件。
</p></li>

<li><p>
<code>--alloc-fn=&lt;name&gt;</code>
</p>

<p>
指定一个分配内存的函数。这对于使用 malloc() 的包装函数是有用的，可以用它来填充原来无效的上下文信息。(这些函数会给出无用的上下文信息，并在图中给出无意义的区域)。指定的函数在上下文中被忽略，例如，像对 malloc() 一样处理。这个选项可以在命令行中重复多次，指定多个函数。
</p></li>

<li><p>
<code>--format=&lt;text|html&gt; [default: text]</code>
</p>

<p>
产生 text 或者 HTML 格式的详细堆信息，文件的后缀名使用. txt 或者. html。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org9979b89" class="outline-3">
<h3 id="org9979b89"><span class="section-number-3">7.7</span> HELGRIND 选项：</h3>
<div class="outline-text-3" id="text-7-7">
<ul class="org-ul">
<li><p>
<code>--private-stacks=&lt;yes|no&gt; [default: no]</code>
</p>

<p>
假定线程栈是私有的。
</p></li>

<li><p>
<code>--show-last-access=&lt;yes|some|no&gt; [default: no]</code>
</p>

<p>
显示最后一次字访问出错的位置。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org8d8fef9" class="outline-3">
<h3 id="org8d8fef9"><span class="section-number-3">7.8</span> LACKEY 选项：</h3>
<div class="outline-text-3" id="text-7-8">
<ul class="org-ul">
<li><p>
<code>--fnname=&lt;name&gt; [default: _dl_runtime_resolve()]</code>
</p>

<p>
对 &lt;name&gt; 函数计数。
</p></li>

<li><p>
<code>--detailed-counts=&lt;no|yes&gt; [default: no]</code>
</p>

<p>
对读取，存储和 alu 操作计数。
</p></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: phenix3443</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-10 二 19:58</p>
<p class="validation"></p>
</div>
</body>
</html>
